app/controllers/items_controller.rb

  def show
    @item = Item.find_by_wow_id(params[:id])
---
SELECT * FROM "items" WHERE ("items"."wow_id" = '39725') LIMIT 1