app/controllers/loots_controller.rb

  def index
    @search = Loot.new_search(params[:search])
    # @search.conditions.raid.start_at_after = 2.months.ago unless params[:search]
    @search.conditions.toon.id = params[:toon_id] if params[:toon_id]
    @search.per_page = 100
    # @search.order_by ||= [{:raid => :start_at}, {:item => :inventory_type}]
    # TODO I don't remember why I was ordering by inventory_type, maybe this should be removed
    @search.order_with_ordering = "raids.start_at desc, items.inventory_type asc"
    @loots, @loots_count = @search.all, @search.count
    @raids = Raid.all(:conditions => {:id => @loots.map{|loot| loot.raid.id}.uniq})
---
SELECT * FROM "loots"
SELECT * FROM `raids` WHERE (`raids`.`id` = 2)

  def show
    @loot = Loot.find(params[:id])
---
SELECT * FROM "loots" WHERE ("loots"."id" = 6)

  def edit
    @loot = Loot.find(params[:id])
---
SELECT * FROM "loots" WHERE ("loots"."id" = 6)

  def update
    @loot = Loot.find(params[:id])

    respond_to do |format|
      if @loot.update_attributes(params[:loot])
---
SELECT * FROM "loots" WHERE ("loots"."id" = 6)
UPDATE "loots" SET "toon_id" = 6, "primary" = 'f', "updated_at" = '2008-12-19 20:47:36' WHERE "id" = 6