app/controllers/raids_controller.rb

  def index
    @raids = Raid.all(:order => 'start_at desc', :include => [:loots, :attendances, :zone])
---
SELECT * FROM `raids` ORDER BY start_at

  def show
    @raid = Raid.find(params[:id])
---
SELECT * FROM "raids" WHERE ("raids"."id" = 1)

  def create
    unless params[:raid_xml]
      flash[:error] = "Raid XML field cannot be empty"
      redirect_to new_raid_path
      return
    end
    @raid = Raid.create_from_xml(params[:raid_xml])
    if @raid.new_record?
      flash[:error] = @raid.errors.full_messages.join("<br/>")
      render :action => 'new'
      return
    end
    flash[:notice] = "New raid created for #{@raid.zone.name} raid on #{@raid.start_at.to_s(:raid)}. #{@raid.loots.size} loots and #{@raid.toons.size} attendees recorded."
---
INSERT INTO `raids` (`end_at`, `updated_at`, `zone_id`, `start_at`, `note`, `key`, `created_at`) VALUES('2008-12-29 23:50:44', '2009-01-06 02:37:27', NULL, '2008-12-29 21:08:32', NULL, '2008-12-29 21:08:32', '2009-01-06 02:37:27')
SELECT * FROM `toons` WHERE (`toons`.`name` = 'chalaure') LIMIT 1