app/controllers/toons_controller.rb

  def index
    @toons = Toon.all(:order => 'rank asc, name asc', :include => [:job], :conditions => {:deleted => false})
---
SELECT * FROM `toons` ORDER BY name